function [ var_real ] = var_correction( data_y,T )
%camera_correction 主要用于修正CCD相机的快门时间带来的测量误差
%温度可以调整


%% 预设定涉及到的参数
w = 1/60;                                                                  %相机的积分时间，本装置采用的是zero dead time 模式
R = 0.5 ;                                                                  %磁球半径，约0.5微米
%水的黏度随温度的变化关系如下，对实验温度差值可得结果。
eta_T = 0:40;
eta_visosity = [1.7921 1.7313 1.6728 1.6191 1.5674 ...
                1.5188 1.4728 1.4284 1.3860 1.3462 ...
                1.3077 1.2713 1.2363 1.2028 1.1709 ...
                1.1404 1.1111 1.0828 1.0559 1.0299 ...
                1.0050 0.9810 0.9579 0.9358 0.9142 ...
                0.8937 0.8737 0.8545 0.8360 0.8180 ...
                0.8007 0.7840 0.7679 0.7523 0.7371 ...
                0.7225 0.7085 0.6947 0.6814 0.6685 0.6560]./1000;

eta = spline(eta_T,eta_visosity,T);                                        %水的黏度，单位是Pa·s = pN*s/μm^2

gamma = 6*pi*eta*R;
k_BT = 1.3806504e-2*( T+273.15 );                                          %k_B*T, 换成了pN*nm之后数量级降到-2，结果为4.128pN*nm
danwei=1000;
var_m=var(data_y);

%% 进行积分时间修正，解出真正的var

y = @(x)danwei*2*gamma*x.^2/(w*k_BT) - (danwei^2)*2*gamma^2*x.^3/(w*k_BT)^2 .* (1-exp(-w*k_BT./((danwei)*gamma*x)))-var_m;    % 解var的隐函数，其中1000的因子是力值公式的单位换算，使得最后结果单位为nm
var_real = fzero(y,0);                                                     %求解该函数的根（数值解）


%%  一些参数，留作参考，可以略去
% tao = gamma * var_real*1000/k_BT;
% alpha = w/tao;
% S_a = 2/alpha - 2/alpha^2 * (1-exp(-alpha));

end



